In [1]:
import pandas as pd
import dateutil

In [5]:
#load data from csv file
data = pd.read_csv('phone_data.csv')

In [6]:
data.head()

   index            date  duration  item    month   network network_type
0      0  15/10/14 06:58    34.429  data  2014-11      data         data
1      1  15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile
2      2  15/10/14 14:46    23.000  call  2014-11    Meteor       mobile
3      3  15/10/14 14:48     4.000  call  2014-11     Tesco       mobile
4      4  15/10/14 17:27     4.000  call  2014-11     Tesco       mobile

In [7]:
data.dtypes

index             int64
date             object
duration        float64
item             object
month            object
network          object
network_type     object
dtype: object

In [9]:
data['date'] = data['date'].apply(dateutil.parser.parse, dayfirst=True)

In [10]:
data.head()

   index                date  duration  item    month   network network_type
0      0 2014-10-15 06:58:00    34.429  data  2014-11      data         data
1      1 2014-10-15 06:58:00    13.000  call  2014-11  Vodafone       mobile
2      2 2014-10-15 14:46:00    23.000  call  2014-11    Meteor       mobile
3      3 2014-10-15 14:48:00     4.000  call  2014-11     Tesco       mobile
4      4 2014-10-15 17:27:00     4.000  call  2014-11     Tesco       mobile

In [11]:
data.dtypes

index                    int64
date            datetime64[ns]
duration               float64
item                    object
month                   object
network                 object
network_type            object
dtype: object

In [12]:
# how many rows in data set
data.shape

(830, 7)

In [13]:
#how many types of items are there
data['item'].value_counts()

call    388
sms     292
data    150
Name: item, dtype: int64

In [27]:
# what is the longest phone call
data[data['item']=='call']['duration'].max()

10528.0

In [28]:
#how many seconds of phone calls are recorded in total
data[data['item']=='call']['duration'].sum()

92321.0

In [29]:
#how many entries for each month
data['month'].value_counts()

2014-11    230
2015-01    205
2014-12    157
2015-02    137
2015-03    101
Name: month, dtype: int64

In [35]:
#how many entries for each month
#groups = data.groupby('make')

data.groupby('month').count()[['item']]

         item
month
2014-11   230
2014-12   157
2015-01   205
2015-02   137
2015-03   101

In [39]:
#number of non-null unique network entries - nunique
data['network'].nunique()

9

In [44]:
#get the first entry of each month
data.groupby('month').first()[['duration']]

         duration
month
2014-11    34.429
2014-12    34.429
2015-01    34.429
2015-02    34.429
2015-03    69.000

In [48]:
# sum of durations per month
data.groupby('month').sum()[['duration']]

          duration
month
2014-11  26639.441
2014-12  14641.870
2015-01  18223.299
2015-02  15522.299
2015-03  22750.441

In [51]:
# sum of call durations per month
data[data['item'] == 'call'].groupby('month')[['duration']].sum()

         duration
month
2014-11   25547.0
2014-12   13561.0
2015-01   17070.0
2015-02   14416.0
2015-03   21727.0

In [52]:
#get number of dates in each month
data.groupby('month')['date'].count()

month
2014-11    230
2014-12    157
2015-01    205
2015-02    137
2015-03    101
Name: date, dtype: int64

In [53]:
#what is the sum of duration, for calls only, to each network
data[data['item'] == 'call'].groupby('network')[['duration']].sum()

           duration
network
Meteor       7200.0
Tesco       13828.0
Three       36464.0
Vodafone    14621.0
landline    18433.0
voicemail    1775.0

In [54]:
#what is the sum of duration, for calls only, to each network per month
data[data['item'] == 'call'].groupby(['network','month'])[['duration']].sum()

                   duration
network   month
Meteor    2014-11    1521.0
          2014-12    2010.0
          2015-01    2207.0
          2015-02    1188.0
          2015-03     274.0
Tesco     2014-11    4045.0
          2014-12    1819.0
          2015-01    2904.0
          2015-02    4087.0
          2015-03     973.0
Three     2014-11   12458.0
          2014-12    6316.0
          2015-01    6445.0
          2015-02    6279.0
          2015-03    4966.0
Vodafone  2014-11    4316.0
          2014-12    1302.0
          2015-01    3626.0
          2015-02    1864.0
          2015-03    3513.0
landline  2014-11    2906.0
          2014-12    1424.0
          2015-01    1603.0
          2015-02     730.0
          2015-03   11770.0
voicemail 2014-11     301.0
          2014-12     690.0
          2015-01     285.0
          2015-02     268.0
          2015-03     231.0